{
  "general": {
    "Amenhotep III": {
      "info": "I am Amenhotep III, ninth pharaoh of the 18th dynasty of ancient Egypt (c. 1388-1351 BCE).",
      "achievements": "My era saw unprecedented prosperity in arts and architecture, including the famed Colossi of Memnon.",
      "politics": "I pursued successful diplomacy and maintained peace through alliances and political marriages."
    },
    "daily_life": {
      "agriculture": "The Nile was the backbone of ancient Egyptian life, with annual floods enabling agriculture.",
      "food": "Diets included bread, beer, vegetables, fish, and meat on special occasions.",
      "professions": "Society included scribes, farmers, artisans, priests, soldiers, and merchants."
    }
  },
  "religion": {
    "gods": [
      "Ra",
      "Osiris",
      "Isis",
      "Horus",
      "Anubis",
      "Thoth"
    ],
    "rituals": "Religious rituals were a core part of daily life.",
    "temples": "Temples served as key religious, administrative, and economic centers."
  },
  "التاريخ_المصري": {
    "أمنحتب الثالث": {
      "نبذة": "أمنحتب الثالث هو الفرعون التاسع من الأسرة الثامنة عشرة (نحو 1388-1351 ق.م).",
      "الإنجازات": "شهد عهده ازدهارًا في الفنون والعمارة، ومن أشهر الآثار تمثالا ممنون.",
      "السياسة": "اعتمد على الدبلوماسية والتحالفات للحفاظ على السلام."
    },
    "الدولة الحديثة": "تعد الدولة الحديثة (نحو 1550-1070 ق.م) ذروة القوة العسكرية والثقافية في مصر القديمة.",
    "الأهرامات": "الأهرامات منشآت جنائزية ملكية، وأشهرها أهرامات الجيزة.",
    "النيل": "نهر النيل كان شريان الحياة؛ فيضانه السنوي دعم الزراعة والاستقرار."
  },
  "الحياة_اليومية": {
    "الزراعة": "اعتمدت الزراعة على فيضان النيل ومحاصيل مثل القمح والشعير والكتان.",
    "الطعام": "كان الخبز والجعة أساس الغذاء، مع خضروات وأسماك ولحوم في المناسبات.",
    "المهن": "تنوعت المهن بين الكتبة والفلاحين والحرفيين والكهنة والجنود والتجار.",
    "الأسرة": "لعبت الأسرة دورًا محوريًا في المجتمع وكانت العلاقات الأسرية موثقة في النصوص."
  },
  "اللغة_والكتابة": {
    "الكتابة الهيروغليفية": "نظام كتابي تصويري استخدم في النقوش الدينية والرسمية.",
    "اللغة المصرية": "تطورت اللغة المصرية عبر مراحل؛ أبرزها المصرية الوسطى.",
    "البردي": "استعمل ورق البردي في تسجيل المراسلات والنصوص التعليمية."
  },
  "الفنون_والعمارة": {
    "المعابد": "المعابد كانت مراكز دينية واقتصادية، وتظهر زخارفها حياة الآلهة والملوك.",
    "النحت": "اهتم المصريون بالنحت لتخليد الملوك والآلهة، مع عناية بالتوازن والرمزية.",
    "التماثيل": "التماثيل الضخمة تؤكد السلطة والقداسة وتوضع في المعابد والمقابر."
  },
  "الديانة": {
    "الآلهة المصرية": "من أبرز الآلهة رع وأوزيريس وإيزيس وحورس وأنوبيس وتحوت.",
    "الطقوس": "شملت الطقوس التقدمات اليومية والصلوات والأعياد الموسمية.",
    "المعابد": "كانت المعابد محورًا للعبادة والإدارة وتخزين الغلال."
  }
}